tap "anomalyco/tap"
tap "epk/epk"
font "font-sf-mono-nerd-font"
brew "aria2"
brew "atomicparsley"
brew "chafa"
brew "cmake"
brew "colima"
brew "coreutils"
brew "curl"
brew "displayplacer"
brew "docker"
brew "docker-compose"
brew "fd"
brew "ffmpeg"
brew "glfw"
brew "graphviz"
brew "iperf3"
brew "jq"
brew "mp4v2"
brew "lazygit"
brew "neomutt"
brew "neovim"
brew "nmap"
brew "node@24"
brew "openjdk@17"
brew "openjdk@21"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pngpaste"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "syncthing", restart_service: :changed
brew "task"
brew "tmux"
brew "tree"
brew "wget"
brew "yt-dlp"
brew "zoxide"
brew "anomalyco/tap/opencode"
cask "anki"
cask "coconutbattery"
cask "crossover"
cask "discord"
cask "ghostty"
cask "helium"
cask "iina"
cask "istat-menus"
cask "karabiner-elements"
cask "lm-studio"
cask "lulu"
cask "mactex"
cask "mos"
cask "neovide-app"
cask "obs"
cask "obsidian"
cask "pearcleaner"
cask "qbittorrent"
cask "raycast"
cask "shottr"
cask "signal"
cask "skim"
cask "slack"
cask "the-unarchiver"
cask "zoom"
