tap "anomalyco/tap"
tap "asmvik/formulae"
tap "epk/epk"
tap "theboredteam/boring-notch"
# Download with resuming and segmented downloading
brew "aria2"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Multi-platform library for OpenGL applications
brew "glfw"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Client library for huggingface.co hub
brew "hf"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Read, create, and modify MP4 files
brew "mp4v2"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node@24"
# Development kit for the Java programming language
brew "openjdk@21"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Paste PNG into files
brew "pngpaste"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Open source continuous file synchronization application
brew "syncthing",
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd"
# Memory training application
cask "anki"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Voice and text chat software
cask "discord"
cask "epk/epk/font-sf-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# Keyboard customiser
cask "karabiner-elements"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Open-source software for live streaming and screen recording
cask "obs"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Control your tools with a few keystrokes
cask "raycast"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Unpacks archive files
cask "the-unarchiver"
# Utility to hide the notch
cask "topnotch"
# Video communication and virtual meeting platform
cask "zoom"
